Revit 2024 API
RoofType.ThermalProperties Property
 The calculated and settable thermal properties of the RoofType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ThermalProperties ThermalProperties { get; }
Visual Basic
Public ReadOnly Property ThermalProperties As ThermalProperties
	Get
Visual C++
public:
property ThermalProperties^ ThermalProperties {
	ThermalProperties^ get ();
}
Remarks
 Returns null if the roof has no thermal properties. Curtain roofs do not store thermal properties.
See Also
RoofType Class
Autodesk.Revit.DB Namespace